/**
 *
 *    Полифил и транспиляция позволяет использовать новые функции в старых стандартах языка.
 *
 *    Typescript может транспилировать код в указанный стандарт. Но не весь код может быть
 *  транспилирован полностью.
 *
 *     - транспиляция используется там, где старый синтаксис не позволяет реализовать нативно новую
 *       фукциональность. выполняется во время компиляции
 *
 *     - полифил используют там, где возможно нативно реализовать новые функции. выполняется во
 *       время выполнения
 *
*/